[
  {
    "year": "2025",
    "events": [
      {
        "date": "March 14",
        "title": "[News of Jay's Death - The Ignition Factor]:",
        "content": "[Hell] Gegagedigedagedago and Omega Roasted Chicken use an \"e\" tile to travel to the depths of Hell with the goal of reviving The numberphile. Greeting his old nemesis at the bottom of an infinite hole, the numberphile is revived and thanks the Omega Nugget. Both parties end up leaving Hell, with the numberphile jumping off and Gegagedigedagedago and Omega Roasted Chicken leaving by opening another \"e\" portal."
      },
      {
        "title": "[The Hour of Joy - Poppy Playtime: Chapter 3]:",
        "content": "[Hell] CraftyCorn uses the “e” portal Gedagedigedagedago opened to enter Hell to escape back into the Omega Universe, shoving Jerry out of the way."
      },
      {
        "date": "April 1",
        "content": "Dr. Andonuts hosts an event themed around games inside other pieces of media as a form of “immersive therapy” following the events of “Cognitive Dissonance”."
      },
      {
        "title": "[Good Ending - Sand Mountain: The Game]:",
        "content": "Henry Fauntleroy Cat jumps in front of Patrice Star as he is about to crash into a mountain. Patrice thanks Henry for rescuing him and the two declare they’ll be best friends forever. The end of the rip shows this to be part of the video game Patrice is playing, though."
      },
      {
        "title": "[DEAD - Sand Mountain: The Game]:",
        "content": "Henry Fauntleroy Cat prepares to jump in front of Patrice to save him from hitting the mountain, however, he misses, and Patrice crashes into the mountain repeatedly. Henry then cries and laments his inability to save Patrice."
      },
      {
        "title": "[Cuh - Omegarune]:",
        "content": "[Omegarune] Charlie is gifted the Egg of All-Devouring Darkness by a Cuh in Omegarune."
      },
      {
        "date": "April 17",
        "title": "[SiIvaGunner SmashUp! 2]:",
        "content": "A sequel tournament is held, with the same prize as last time. Stingy wins."
      },
      {
        "date": "April 20",
        "content": "The channel hosts an event dedicated to Easter featuring several rips set in worlds beside ours related to the holiday."
      },
      {
        "title": "[Game with Rabbit Set Up (In-Game Version) - Othello World]:",
        "content": "[Othello World] Having become the new ruler of Easter Spirit after Naxx Guyfieri and the Easter Bunny’s deaths, the Rabbit spreads it across the Omega Universe and the various other ones in celebration of Easter."
      },
      {
        "title": "[Alpha Omega Easter Egg - Call of Duty: Black Ops IIII]:",
        "content": "Tired of the Omegas disrespecting their kind during Easter, Boss Egg and his henchmen launch a plot to rob everyone of their eggs. Unbeknownst to them, Nikocado Avocado was spying on the Egg Bandits as they left their headquarters."
      },
      {
        "title": "[Tubby Custard Machine - Play With The Teletubbies]:",
        "content": "The Sussytubbies hold an easter egg hunt to celebrate Easter. During this hunt, the White Egg bandit holds Ohipo at gunpoint before being grabbed and thrown away by Noo-Noo, which shatters the White Egg bandit. Nikocado then pops out from a hole and kidnaps him."
      },
      {
        "title": "[Bonnie's Lullaby (In-Game Version) - Five Nights at Freddy's 3]:",
        "content": "Spreingtrep tries to become the “Easter Bonnie” by hiding eggs for all his friends. Things start falling apart when Spreingtrep is confronted by the real Easter Bonnie, who tries to kill him. Mr. Service, an FBI agent similar to Mr. Rental and Own, mistakenly arrests the Easter Bonnie due to thinking he’s Spreingtrep."
      },
      {
        "title": "[Quiet Water (Genocide Version) - Undertale]:",
        "content": "Kitchen Gun collects Pipis in Waterfall while being followed by the Brown Egg bandit. The Brown Egg bandit tries to steal Kitchen Gun’s Pipis collection, though he’s stopped by Derek Bum defeating him in a gun duel. Having followed the Brown Egg Bandit, Nikocado Avocado collects his body lying down inside one of Waterfall’s rivers."
      },
      {
        "title": "[death.wav - Garry's Mod]:",
        "content": "[Garry’s Mod Universe] Several characters, including the Beatles, Gork, Gamechap and Bertie, attend Gabe Newell’s funeral event to mourn the sad loss of a gaming icon. As part of his “testimonial”, Ninja announces he’ll be exclusively streaming on Mixer from now on, which angers the audience. Before a fight can break out, Gabe Newell rises from his grave and makes Ninja run away in fear."
      },
      {
        "title": "[No Way Back - Egg Squeeze]",
        "content": "Annoyed at his henchmen taking too long, Boss Egg decides to take action into his own hands by blowing up the Omegas if they do not hand over their eggs. It is at this moment that he is kidnapped by Nikocado Avocado and taken to his old lair alongside his fellow Egg Bandits. Nikocado eats the Egg Bandits alive, which causes him to both regain his lost weight and lay a golden egg from which a thin Nikocado clone hatches."
      },
      {
        "title": "[Mario Bros. House - Super Paper Mario]",
        "content": "Nice Brainless and Silentó take the Minecraft Egg dropped by Grimace upon his death and plant it into the ground. This results in the creation of a Grimace tree from which new Grimaces are dropped, successfully resurrecting Nice Brainless and Silentó's fallen friend."
      },
      {
        "title": "[Egg of All-Devouring Darkness (In-Game Version) - Egg Hunt 2012]",
        "content": "Charlie returns to the steak factory and finds a note hidden by The numberphile, which tells the former that he left an egg for Charlie to find. Charlie finds the egg and becomes terrified upon seeing an \"e\" on a dice block egg, believing that his former friend came back to kill him. When the Egg of All-Devouring Darkness starts whispering to Charlie that his sins will soon catch up to him in the form of an “angel” and “devil”, Charlie flees through an \"e\" portal."
      },
      {
        "content": "Meanwhile, Badtz-Maru visits Tsunko and Pandaba's graves and collects the eggs left next to them."
      },
      {
        "date": "April 21",
        "title": "[My Last Stand (Funny Jojoke HaHA)]",
        "content": "Dr. Andonuts, who's accompanied by The Joke-Explainer™ 7000 and her replica, finishes his latest invention inside of his lab and presents it to Pomni. Andonuts asks Pomni if she's ready to test the VR headset out."
      },
      {
        "title": "[Nutshackwoodman34 [FILE-18] - Haltmann’s Archives]",
        "content": "Dr. Andonuts discovers Nutshackwoodman34's videos and makes note of the striking similarities to HWC’s work and CCC-Prime in general, noting how The Lost Rip seemingly depicts Illucidity several years before it was implemented. Andonuts later updates the file, talking about the reports from several years ago. He deduces that the videos arise from an alternate timeline diverged from CCC-Prime at some point in 2017, potentially due to Fools' Spirit in an effect opposite to the neutralization of Anomalies, cordoning them off to their own timeline due to their power. He provisionally names the timeline CCC-FOOLS."
      },
      {
        "content": "Pulling from the Voice's visions of the BLACK timeline and the Three Moons Timeline (where a group aligned with the SCP Foundation arrests The Voice for 'crimes against anime'), Andonuts questions how alternate timelines like CCC-FOOLS could be created, alongside expressing surprise regarding their knowledge of his relationship with Pomni."
      },
      {
        "date": "June 1",
        "title": "[Announcing my special day!]:",
        "content": "The Joke-Explainer™ 7000 attempts to celebrate her birthday, but her announcement is hijacked by Stingy, who exercises the secret clause in his contract with the former. Members of SiIvaCord rebuke Stingy severely for his actions, with some even calling for his death."
      },
      {
        "date": "June 4",
        "content": "Deltarune’s third and fourth chapters are released."
      },
      {
        "date": "June 20",
        "content": "TimmyTurnersGrandDad announces that it will go on indefinite hiatus starting from January 1, 2026, citing the retirement of two backroom managers and the lack of any suitable replacements for their positions."
      },
      {
        "date": "June 22",
        "title": "[Birthday Surprise! ~ Side Story - A Date with Boykisser!]",
        "content": "Y/N attends Boykisser’s birthday party. They and the rest of the guests begin eating (salmon) cake and give their respective gifts to Boykisser. Y/N gives Boykisser their present, a copy of DOOM (2016): Boykisser Edition for the XBOX 720. Boykisser thanks Y/N for their present."
      },
      {
        "content": "After the party is over, Boykisser reveals to Y/N he also got a gift for them; tickets to a vacation in Poland. Y/N accepts their gift as well as the vacation, leaving Boykisser overjoyed."
      },
      {
        "date": "June 26",
        "title": "[Game Over - Mr. Krabs Overdoses on Ketamine]:",
        "content": "Henry Fauntleroy Cat attends Patrice’s funeral. He begins giving a eulogy. When he finishes, Patrick attempts to give a eulogy, though he is simply unable to, having not yet fully processed his brother’s death."
      },
      {
        "content": "Henry Fauntleroy Cat then asks Mr. Krabs to give a eulogy, but Mr. Krabs overdoses on ketamine and is taken away by an ambulance, Patrick reassures Henry Fauntleroy Cat that Mr. Krabs will be fine, given that this is his fifth overdose since losing the King for Another Day Tournament and that he survived all of his past ones."
      },
      {
        "content": "SpongeBob then walks up to Patrick to tell him they’re late for the rope burn convention. Patrick tells Henry Fauntleroy Cat he’ll see him later, leaving the latter confused due to it being Patrice's funeral and the events of Mr. Krabs' overdose earlier."
      },
      {
        "date": "July 1",
        "content": "Stingy gives back the SiIvaGunner channel to The Joke-Explainer™ 7000 with an apology. Joke-Explainer accepts the apology, and continues operations."
      },
      {
        "date": "July 5",
        "title": "[The Tower - Mortal Kombat II]:",
        "content": "After the Totino’s TKO SiIva Kombat tournament Grand Finals match, Butch Mustard holds a post-match interview with both players, Waba and FM. Leonard attends the tournament to investigate Gork, who is watching in the Garry’s Mod Universe and becomes frustrated when he finds out SiIva Kombat II didn’t credit him. As a result, he opens up a portal and begins traveling to an unknown universe to get revenge."
      },
      {
        "content": "While Gork is traveling through the portal, the video cuts to a Franklin’s Email segment. Leonard gets Franklin to read an e-mail he wrote on Franklin’s e-mail, gaining access to it. Leonard sends e-mails to ARG solvers and realizes that Bird Up! can save SiIvaSwim from going under."
      },
      {
        "content": "Gork is revealed in a log to be an anomaly that lives inside timeline \"4BC-916V / PUREST\"'s \"Jeef Berky Galaxy\". The log then describes the structure of Gork's universe (\"ZONE > REALM > DIMENSION > GALAXY > TIMELINE\") and The \"Five Leaf Clover\", a crop which has interdimensional abilities that activate when someone rips off one of its petals."
      },
      {
        "date": "July 24",
        "title": "[Here We Are (2024/2025 Edition) - Undertale]",
        "content": "HCB writes ENnnnntRRY, where he details how their house has been destroyed since the Fisher-Price Hacker’s fight at Super MAGFest 2025 and that they haven’t been uploaded due to being worried that the Joke-Explainer would find him out. Having discovered the other universes through the channel’s lore videos, HCB comes up with a plan to harness them in an attempt to restore his control over the channel and sets out to find the items they still need before it’s complete."
      },
      {
        "date": "August 3",
        "title": "[Main Theme - Pokémon Showdown]",
        "content": "HCB begins his quest to obtain the items he needs for his plans by disguising himself as a Dachsbun and participating in the Pokémon Showdown match between davidgaming132 and s3izeURm0m3nt. During this battle, the disguised HCB steals Blazikenite from s3izeURm0m3nt’s Grandon."
      },
      {
        "title": "[Moon Lord Fanfare (Beta Mix) - Terraria]",
        "content": "HCB runs over a player dressed as Kris from Deltarune with a minecart in Terraria and steals their Palladium Sword, Shadowbeam Staff and Rocket Boots from a chest."
      },
      {
        "title": "[Blackpath (Devil Room) - The Binding of Isaac: Antibirth]",
        "content": "HCB travels from Terraria to The Binding of Isaac: Antibirth and uses their new Rocket Boots to snatch the Teleporter 2.0, a quarter and the Star of Bethlehem from the game’s Devil and Angel Rooms."
      },
      {
        "title": "[Party Time - Baldi’s Basics Classic Remastered]",
        "content": "As part of the final preparations for his plan, HCB uses the quarter he obtained previously to get the Dangerous Teleporter from a vending machine in Baldi's Basics Classic Remastered. He is then caught by Baldi, which causes the game to suffer from a critical error."
      },
      {
        "title": "[In-Game - Fisher-Price: Perfect Fit]",
        "content": "HCB is booted back to the Fisher-Price Hacker’s desktop and uses the Teleporter 2.0 to upgrade the Channel Connection Establisher to the Universe Connection Establisher 2.0. By using a Brainless-infected rip as the artifact for the device, HCB creates a portal to the Omega Universe, ready to execute their plan to regain control over SiIvaGunner."
      },
      {
        "title": "[Kirby Dance (Long) (Alternate Version) - Kirby: Squeak Squad]:",
        "content": "The Itsy Bitsy Spider climbs up the water spout."
      },
      {
        "date": "August 4",
        "title": "[Opening Broadcast - SiIvaGunner: Law & Disorder – Lethal Proceedings]",
        "content": "Monokuma announces the start of the Law and Disorder Takeover. Phoenix questions why they’re getting a takeover despite not winning the tournament. Monokuma shuts the question down, claiming there is no mystery to solve. Using his magatama, Phoenix sees five psyche-locks surround Monokuma, confirming he’s hiding something. He decides to investigate on the side."
      },
      {
        "title": "[Monokuma Theater #1 - SilvaGunner: Law & Disorder - Lethal Proceedings]",
        "content": "Monokuma tells the story of how Principal John Notmonokuma announced a killing game where a live audience could vote which of the 32 students of \"Hope for Another Day Academy\" would survive and which one would get a brutal punishment."
      },
      {
        "content": "During the killing game, students fell to the wayside one by one while the audience indulged in the despair of the tournament and cheered on the \"true hero of despair\" Monokuma, portrayed as a handsome boy. Monokuma then talks about how he worked with Phoenix Wright, nicknamed \"Lawyer Boy\" and portrayed as a stereotypical nerd, to bulldoze the competition until the final round."
      },
      {
        "content": "In this final round, Monokuma and his sidekick faced off against his arch rival, DJ Professor K, who kept getting on Monokuma's skin due to constantly preaching about spreading \"hope and love\" and getting higher scores than him. By the time of the killing game's conclusion, DJ Professor K managed to win over the hearts of the audience, saved the losers from getting mauled by bears and banished Monokuma and Lawyer Boy to the loser's clubs, things Monokuma rants about during his story."
      },
      {
        "content": "Attempting to regain his composure somewhat, Monokuma tries to convince himself that he won in the end due to him and his fans getting to experience \"the despair of losing\". He doesn't keep his composure for long, as he soon falls back into ranting about losing the tournament despite putting in his best efforts, with him even saying DJ Professor K sucks, and trying to deny that he lost in the first place."
      },
      {
        "title": "[Investigation 1]",
        "content": "After watching Monokuma’s dramatized retelling of the King for Another Tournament, Phoenix Wright discovers a note the murderous bear left for him on a Law & Disorder poster. By watching an archive of DJ Professor K’s livestream, he further learns about the existence of the SiIva AI through the AI log featured at the end."
      },
      {
        "date": "August 5",
        "title": "[Monokuma Theater #2 - SilvaGunner: Law & Disorder - Lethal Proceedings]",
        "content": "John Apocalypse, Creator of the Apocalypse had only one dream, which he wanted to achieve despite people telling him it was impossible: to create the apocalypse. Unwilling to let others discourage him from completing his dream, he enrolled in \"Apocalypse's Peak Academy\", where he graduated as the top of his class, and gathered funds from those interested in the creation of the apocalypse to fund his own \"Apocalypse Creation\" company."
      },
      {
        "content": "By working together with his childhood friend, Pibby, he realized that the best way to create an apocalypse in his world was by creating every apocalypse all at once. John Apocalypse was driven to despair by the seemingly impossible method of causing an apocalypse in the AI Universe, but realized what needed to be done after the discovery of an incoming meteor."
      },
      {
        "content": "With all of his nay-sayers attending Wood Man's Halloween House Party (ft. David S. Pumpkins), John Apocalypse put his plans to cause the apocalypse into place, which supposedly caused the events of SiIvaGunner All-Star Nuclear Winter Festival. The performance then ends with a non sequitur where Monokuma asks the viewer to subscribe to the channel if they like Pibby, promising that more Pibby content is coming."
      },
      {
        "title": "[Investigation 2]:",
        "content": "This performance causes Phoenix to investigate the apocalypse, learning through a viewing of \"ALL-STAR NUCLEAR WINTER FESTIVAL: FULL MOVIE\" that he lived through it and that the Joke-Explainer blames herself for Wood Man’s disappearance. Phoenix gives the Joke-Explainer a motivational speech to not give into despair and they are in this together."
      },
      {
        "date": "August 6",
        "title": "[Monokuma Theater #3 - SiIvaGunner: Law & Disorder – Lethal Proceedings]",
        "content": "Monokuma tells the story of a failing donut shop in the city of National Harbor, one which was formerly extremely successful and started failing after people stopped wanting coffee and donuts. The owners were approached by one of their employees they hired on a whim. Monokuma then exposits about how Waluigi had been raised on all kinds of delicacies, including tacos, and how he made a taco for the donut shop's owners. As the most delicious thing the owners ever tasted, they begged him to put it on their menu and their business skyrocketed thanks to it."
      },
      {
        "content": "However, Waluigi had been scheming behind the scenes to take the donut shop for himself, with him eventually managing to dethrone the original owners and throw them on the streets. Monokuma then explains to the audience that Waluigi's tacos were so delectable thanks to its usage of garlic and how he kept putting more and more garlic onto his tacos to earn more money."
      },
      {
        "content": "This went on until he put so much garlic onto his taco that it resulted in a portal opening up and sucking Waluigi and his entire restaurant into it. Once the portal closed, it never opened up again with the whereabouts of Waluigi and his restaurant unknown, though Monokuma says some thought they were in a land called \"The Garlic Dimension\". Monokuma then ends his story off by questioning why anyone would put garlic on a taco and says he's glad Waluigi disappeared."
      },
      {
        "title": "[Investigation 3]:",
        "content": "This performance leads Phoenix Wright to discover Monokuma’s failed attempt at creating a Garlic Taco portal from the Joke-Explainer and a computer featuring the Haltmann Works Company’s archives."
      },
      {
        "content": "Phoenix reads Last Warning [FILE-22], making note of its harsh tone and it being out of place with the rest of the documents. Upon seeing the signature “J.E.”, Phoenix begins to distrust the Joke-Explainer, believing that she wrote the archive."
      },
      {
        "date": "August 7",
        "title": "[Trial - Part 1] and [Trial - Part 2]:",
        "content": "Three days into their Takeover, Phoenix suddenly wakes up inside a courtroom with the Joke-Explainer beside him (who had moved him and his desk whilst asleep to prepare for the trial). Phoenix notices the door to the courthouse is open and tries to escape, only to be dragged to the defense stand as Monokuma reveals himself as the judge."
      },
      {
        "content": "Phoenix attempts to figure out Monokuma's motives, and when Monokuma tries claiming that the takeover was KfaD Enterprises' idea, Phoenix shuts him down by revealing what the note on the KFAD2 poster meant: the whole thing was Monokuma's idea. Monokuma's psyche locks break and he admits that he started the takeover since their prize was delayed constantly and the whole 'nuclear winter' bailed them out of their obligations."
      },
      {
        "content": "Monokuma then reveals that he plans to leave AIRTH through a GTP and invites Phoenix to go with him since there were apparently no other survivors, but Phoenix snuffs him out by using both a newspaper and a photo of Monokuma with a Garlic Taco to question both his lines of thinking."
      },
      {
        "content": "He then mistakenly summons RepliJE to the stand (thinking that she wrote FILE-22) accusing that she and Monokuma were in cahoots. She profusely denies this, and Monokuma traps her in a cage for contempt of court. Phoenix then realises his mistake and pivots, arguing through the SiIva AI log that the AI created Monokuma as his proxy, which Monokuma denies."
      },
      {
        "content": "As his next move, Phoenix shows the All-Star Nuclear Winter Festival movie on the USB and uses his appearance in the credits to argue it depicted events that actually happened. From the Joke-Explainer's emotional reactions to the film, he realizes that he can trust her and that Monokuma somehow took his memory away, which Monokuma dodges by trying to convince him to leave ARITH again."
      },
      {
        "content": "While pondering why Monokuma is so vague about the details of his plan alongside the Joke-Explainer's part in it, Phoenix realises that \"J.E.\" was Monokuma's co-conspirator in the \"new world\" feeding him information through the Joke-Explainer, painting them as a high-ranking scientist no different than a mastermind. Monokuma breaks down and attempts to call a mistrial, but before he can do so he is interrupted by the real \"J.E.\": Junko Enoshima."
      },
      {
        "content": "Phoenix realises that Junko was the one who wrote FILE-22 whilst she rants about how AIRTH is a dying simulation thanks to the SiIva AI's death, that she used FILE-22 as a coded signal for Monokuma to take over the SiIvaGunner channel and that she also tried to hijack the AI to generate despair but failed miserably, choosing instead to strongarm it into making Monokuma for the express purpose of bringing despair and that she eventually wanted to bring Monokuma to the CCC, all while taunting Phoenix for being a bad attorney."
      },
      {
        "content": "However, Junko's plan was thwarted by the AI spotting Monokuma and lumping him with Phoenix to create Law & Disorder as a team in KFAD2. Thanks to this and Junko being monitored by HWC meant that her plan could not move forward until after the SiIva AI died and Monokuma kidnapped the Joke-Explainer. Furthermore, Monokuma couldn't actually leave AIRTH alone since both the viewers saw him and Phoenix as a duo and they hadn't gotten their prize for third place."
      },
      {
        "content": "With Junko incriminating herself, she tries to end the trial by having Monokuma kill Phoenix, which he refuses. Junko convinces him to change his mind but only he adds an extra rule: the loser of the trial would be executed. Junko allows Phoenix to free the Joke-Explainer, confident in her impending victory."
      },
      {
        "content": "Phoenix presents Monokuma as his single piece of evidence, but he exploits the 'one piece of evidence allowed' rule by having the Joke-Explainer replicate the KFAD2 poster from earlier, using Monokuma's message (\"I made sure we would be together, again, to have this moment.\") to propose that he had willingly let himself be spotted by the AI, to which he admits is correct, debunking Junko's 'just following orders' testimony."
      },
      {
        "content": "Junko tries to save face but Phoenix retorts, saying that there was no need to convince him to come to the CCC if he wasn't part of the plan at all and that she could have killed him to end Law & Disorder, implying that Monokuma didn't want to kill Phoenix, meaning that his ideas didn't align with hers. Junko then claims that it was all a plan to extract despair from Phoenix but even this is rebuffed, with him stating that Monokuma did more than enough for a third-place prize."
      },
      {
        "content": "Junko, having grown frustrated, tells Monokuma to kill Phoenix (again) whilst opening a bridge from AIRTH to the CCC from the Voice's tower. She comes back to Monokuma being covered in a red substance, which he reveals is not blood, but jelly from the courthouse's donuts as Phoenix gives his closing argument: Junko's research into despair was flawed as she didn't account for hope, and that the people of AIRTH - including Monokuma - chose their own paths because they keep hoping."
      },
      {
        "content": "Junko breaks down in despair as Monokuma executes her by self-destruction, releasing the Joke-Explainer from his control. Phoenix and Monokuma have one final conversation before he floats away on a balloon, leaving Phoenix and the Joke-Explainer behind to ponder about hope and the future."
      },
      {
        "title": "[Credits - SiIvaGunner: Law & Disorder – Lethal Proceedings]:",
        "content": "Monokuma has visited DJ Professor K's studio to brag about the increased duration and scope of his takeover compared to K's, and plays Bomb Rush Cyberfunk while waiting for him to show up. While talking to the viewers, Monokuma repeatedly mentions a \"change of plans\" in the takeover and asks not to look in the video description."
      },
      {
        "content": "After a while, Monokuma switches his character to a DJ Professor K skin and begins to play terribly to show how much of a \"fraud\" he is. Once the real DJ Professor K arrives, Monokuma attempts to harken back to their rivalry from the King for Another Day Tournament; however, K is far less amicable after Monokuma's actions during the apocalypse. Monokuma brags about his takeover, but the conversation quickly descends into personal attacks and shouting matches. Eventually, DJ Professor K gets fed up and takes manners into his own hands, with Monokuma barely having time to announce his album before he is kicked out of the studio."
      },
      {
        "title": "[The Hour of Joy - Poppy Playtime: Chapter 3]:",
        "content": "Catnap mourns Craftycorn’s death. As soon as Catnap wishes Craftycorn was back, she appears. She explains that she used an e portal to escape Hell. Afterwards, the two go to Playtime Co. and plan to wreak havoc on the world, destroying it once and for all. Catnap agrees, and the two set off."
      },
      {
        "content": "However, both Purple Smurf Cat and Purb were listening in on their conversation. Seeking to stop the duo’s plans, Purple Smurf Cat and Purb set out to find The Bean, as he’s the only one who can stop Craftycorn and Catnap."
      },
      {
        "title": "[Teaser Trailer - Poppy Playtime: The Movie]:",
        "content": "The Bean and Craftycorn rap battle against each other. The rap battle ends with both Craftycorn and The Bean exploding and dying as a result."
      },
      {
        "date": "August 10",
        "title": "[Intro Cutscene - Bad Badtz-Maru: Robot Battle]:",
        "content": "The events of Bad Badtz-Maru: Robo Battle are thrown off the rails thanks to Pandaba’s death, with a monochrome version of her appearing before the game “crashes”. The Kitty Inside Your Heart becomes aware that something’s gone wrong in the Sanrio Universe and sets out to investigate."
      },
      {
        "title": "[Game Over - Bad Tsunko no Doki Doki Omikuji]:",
        "content": "The Kitty Inside Your Heart learns Tsunko and Pandaba were killed by a \"weird man\" and a \"talking steak\" by Pochi. After remembering how the numberphile and Charlie, who match said descriptions, appeared in a rip on his special day, the Kitty returns to his house to discover a follow-up to the aforementioned rip. By watching this rip, he confirms that Numberphile and Charlie were the killers and promises to bring them to justice for their crimes."
      },
      {
        "date": "September 3",
        "title": "[The Dark Truth (PS4 Version) - Deltarune]:",
        "content": "The prophecy of a battle between the numberphile and the Kitty Inside Your Heart is told, revealing them to be the “Angel” and “Devil” the Egg of All-Devouring Darkness warned Charlie about. It is further explained that this battle would result in the world being covered in All-Devouring Darkness and the Omegas becoming inanimate, leaving Charlie to fend for himself."
      },
      {
        "date": "September 14",
        "title": "[Howdy! and... Good-Die! - Underveil]:",
        "content": "Charlie has a nightmare about the numberphile coming back to torture him as revenge for his betrayal during the battle against the Omegas. Upon waking up from this nightmare, Charlie decides he needs to go on vacation and opens an \"e\" portal to ei ei ei vacation island, not knowing that Numberphile was following him."
      },
      {
        "date": "September 19",
        "content": "Stingy takes over the channel for a third time to celebrate Talk Like a Pirate Day 2025. Similarly to the 2016 event, the channel is renamed (this time to “Swashbucklin’ Stingy”) and the metadata of the uploaded rips uses words related to pirates."
      },
      {
        "title": "[Mission Four - X]:",
        "content": "The numberphile disguises himself as a pirate and starts sailing towards ei ei ei vacation island on a boat so there won’t be anyone in the way of his reunion with Charlie."
      },
      {
        "date": "October 14",
        "title": "[Your World - KinitoPET]:",
        "content": "The Universe Connection Establisher 2.0 appears above the skies of ei ei ei vacation island and HCB enters the Omega Universe through it. When the Walmart Yodelling Kid discovers that HCB’s plans would likely destroy his universe, he is punched by the latter all the way to Iceland. After teleporting around the world in search of an energy source, HCB decides to disguise himself as an Omega."
      },
      {
        "content": "Meanwhile, the Larva Yakuza begins their plan to steal back ei ei ei vacation island and get revenge on Charlie."
      },
      {
        "title": "[Calm Down - Go Vacation]:",
        "content": "Using a zesty disguise, Krater ambushes Charlie and the Larva Yakuza takes him hostage, threatening to torture him if they don’t get their ransom money. The Kitty Inside Your Heart arrives in the Omega Universe and learns the steak’s location thanks to the Larva Yakuza’s livestream, while the Peanut Omega learns that the former is after Charlie."
      },
      {
        "title": "[Ice Land (NES 2 Version) - Super Mario Bros. 3]:",
        "content": "The Walmart Yodelling Kid boards Ninja’s bus in Iceland and warns him of HCB’s plans. Ninja decides to join the Walmart Yodelling Kid’s quest to stop HCB even if it involves killing him, which shocks Omega Milkshake."
      },
      {
        "date": "October 24",
        "title": "[Game Over (US Version) - New Super Mario Bros.]:",
        "content": "Itsy reads a sign saying that all who climb the waterspout are destined to be washed in the rain. Despite this, Itsy climbs the waterspout anyway."
      },
      {
        "content": "After a while, it begins raining outside. More and more water comes through the waterspout until a flood sends Itsy hurdling down the tube. They land back at the base of the waterspout and leave, reading the sign again (now saying “lmao. told you.”)."
      },
      {
        "content": "Itsy keeps walking, meeting Teto. Teto recognizes she should leave but decides not to because she doesn’t like moving. She continues ranting about rain until she notices the spider isn’t moving, calling it a dumbass. Itsy responds by moving, and the two spend some time together. Teto asks about the waterspout and why they keep trying to climb it, leading to the conclusion that Itsy is trying to reach Beyond the Blue, a whole new world beyond the building."
      },
      {
        "content": "Teto wonders if Itsy wants help, and directs it towards a shopkeeper that’s “really fuckin tall”. Teto also talks about Rinkydink Valtruvian, who had shown up recently, and tells Itsy to check him out at the theater. Itsy leaves after Teto says she has nothing more to say."
      },
      {
        "title": "[Try Again - Balloon Fight]:",
        "content": "Itsy goes to the theater, which is hosting the 3rd Kita vs. Valtruvian debate. When Itsy arrives, they get the news that the theater staff have turned the theater into an ARG, and that to reach the debate room they have to find all 10 hidden Marmalades."
      },
      {
        "content": "After finding all 10 Marmalades, Itsy goes to the gift shop to purchase a tiny poncho, though they’re all out as Shallots purchased the last one. Stuffwell and Itsy attempt to come to a compromise, but E. Gadd interrupts them and sends Shallots to the Palace of Bad Ideas. After this, Tall Marm offers to send the Spider to the palace; once outside the theater, the Itsy Bitsy Spider lands on top of Xx_KartDriver532_xX and the two set off on their way."
      },
      {
        "title": "[Chapter Select - Super Mario Sunshine]",
        "content": "Itsy and Xx_KartDriver_532_xX arrive at the theater’s racetrack, requesting to use it so she can go see Polter from Super Mario Bros. Dimensions (2015). Lakitu grants them permission under the terms that Lakitu receives a copy of Final Cut Pro X from him."
      },
      {
        "content": "Upon meeting Polter, KartDriver asks if Polter can transport Itsy to the Palace of Bad Ideas. Polter is initially apprehensive, stating that ever since the sun disappeared, it’s felt less alive than it used to and that he’s been getting odd readings from it. Despite this, he takes Itsy to the Palace anyway."
      },
      {
        "content": "At the Palace of Bad Ideas, Itsy falls down a crack in the floor, leading her to discover how to jump. She then talks to a mysterious voice who tells to collect 28 figurines as they may come in handy later. After collecting several figurines, Itsy comes across an :angrykitty:, which she barely escapes from. Immediately afterwards, Itsy finds Shallots and is also contacted by a friendliness pellet known as Lemons."
      },
      {
        "content": "Lemons reveals to Itsy that the palace was designed for two people in specific. It also warns Itsy not to interfere with Shallots’ cell, as it is designed to be eternal. Immediately afterwards, however, Shallots teleports to just outside it. Lemons begrudgingly accepts this and tells the two to not cause any trouble. After Lemons leaves, Shallots returns the tiny poncho and the two ally together, with Itsy learning how to abuse the physics engine for fun."
      },
      {
        "content": "The duo then come across Grandpa Semi and Lil Miss Marshmallow, who are arguing over Marshmallow’s competency. Grandpa Semi notices Itsy and asks Marshmallow if it can play his activity (Undertale) with it, which Marshmallow declines as not only is one person currently present in the room, but Itsy is also too small. Shallots then shows up and Grandpa Semi points out how their presence nullifies Marshmallow’s points. Marshmallow reminds Grandpa Semi that Shallots and Itsy are not the people they are waiting for, which Grandpa Semi dismisses and sends Marshmallow to Bulgaria."
      },
      {
        "content": "Afterwards. Shallots volunteers to play Grandpa Semi’s activity, which is to name every song in the Undertale soundtrack. Shallots wins and Grandpa Semi provides the two with a way out; a cannon to go to the Twinzy Tropics. There, they find Perfecto from Rhythm Heaven Fever, who asks if he can give the two a firework show. Itsy and Shallots accept, and Perfecto opens a portal to the Black Ice Caverns after the show."
      },
      {
        "content": "At the Black Ice Caverns, they meet Lemons again, who elaborates on his goals of entertaining the heroes and warns them to leave their story alone. Later, Itsy and Shallots come across The Signbird, who subject them to a trial in their bag. Itsy doesn’t manage to get a single question right, and Signbird declares them to not be a threat."
      },
      {
        "content": "As Itsy leaves, Lemons reappears, questioning Itsy’s motives. Lemons argues with Itsy for a while before sending her elsewhere, and Itsy uses her newly-acquired double jump ability to explore this area of the palace. Itsy eventually reaches The Plaza and meets Dracula, who goes on a three-minute long rant about the Gutsy Bat from EarthBound. When Itsy attempts to leave though, they are teleported to a bullet hill minigame hosted by the Undo Man from WarioWare D.I.Y., with everything playing in reverse. Afterwards, the Undo Man transforms into a blue spider known as “Confucious”."
      },
      {
        "content": "Itsy leaves the plaza and returns to retrieve Shallots from Lemons’ prison. Lemons expresses shock at the fact Itsy was able to leave the plaza and decides to attempt to kill her with bug spray, though Shallots protects her. After giving a speech, Lemons transforms into Mommy Long Legs from Poppy Playtime and begins chasing the two, with several quiz questions popping up as she gives chase, with the answers being the mistake figurines."
      },
      {
        "content": "Mommy Long Legs transforms back into Lemons after hitting a wall and expresses curiosity for why Itsy came to the palace in the first place. She shows the tiny poncho to Lemons, who is very confused at the given answer. She fades away and appears in the next room as a mistake figurine."
      },
      {
        "content": "Shallots and Itsy cross the Plain Meadow and hit a button on a wall, summoning the mysterious voice from earlier. They thank the two for bringing the sun back and say goodbye."
      },
      {
        "content": "The two then appear on a red triangle floating in space, bringing them both back to their home."
      },
      {
        "date": "October 25",
        "title": "Sea of Secrets - Episode 1",
        "content": "Dr. Andonuts guides The Joke-Explainer™ 7000 to a submersible docked at the Grandiose Bay Harbor. He explains in a briefing that Haltmann Works Co.'s detection technology was upgraded due to recent initiatives to protect Grandiose City from anomalies. Some unidentified signals have been triangulated to the Grandiose Bay Area, and Joke-Explainer is tasked with finding, gathering data on, and potentially capturing the anomalous entity that's suspected of sending out the signals."
      },
      {
        "content": "While Joke-Explainer is already aware of what to do, having repeatedly requested to go on a field mission herself, Dr. Andonuts confesses that he's worried for her safety, given recent events. Joke-Explainer reassures Andonuts that she'll be safe, and that she'll contact him with a report as soon as she can. After looking over the submarine one last time, she sets off. As the submarine makes its way to the signal, Joke-Explainer continues running tests to ensure everything's working properly. Joke-Explainer swims out into the ocean, discovering the anomaly is residing in the remains of GiIvaSunner's plane after it crashed back in 2016."
      },
      {
        "content": "As she heads into the wreckage, she sees a figure up ahead of her. Presuming it's the anomaly, Joke-Explainer tries to approach it, just in case it ends up being friendly. The figure turns out to be Bubble Man, sent by the doctor to retrieve the anomaly as well. Joke-Explainer introduces herself, but having been warned of Haltmann Works Co. by Dr. Wily, Bubble Man tries to get her to leave. But then, Bubble Man's tracker goes off, as the anomaly bursts in from the back of the plane; revealed to be Krab-Borg. Krab-Borg rams into Bubble Man, who yells for Joke-Explainer to escape. She jumps in, inserting a 1 euro cent into Krab-Borg's self-destruct slot like in the original Spongebob episode (explaining the joke while she does)."
      },
      {
        "content": "The robot Krabs explodes into pieces, revealing the full skeletal structure of an Aerodactyl and Kabutops. With the bones now revealed as the true source of the signal, Joke-Explainer tells Bubble Man to put them in a bubble while she captures them. The bones are converted into data and absorbed into the first capture cartridge. Right after, Joke-Explainer's radar goes off, sensing another anomalous signal. As she remarks this, Bubble Man rummages through Robo-Krabs' remains to collect the hard drive. Bubble Man quickly says his goodbyes and tries to leave, but when Joke-Explainer asks about the hard drive, he stutters and says that Dr. Wily needs it. Joke-Explainer offers to analyze the drive on her submersible, then give Bubble Man a ride back to the surface. Bubble Man accepts, preferring not to swim all the way back to shore."
      },
      {
        "content": "After the computer finishes scanning, Joke-Explainer notices that Krab-Borg had a set of coordinates marked, labeled \"Underwater Village\", which matched where the next signal was located. She hands back the drive to Bubble Man, who offers for her to come hang out when she returns from her mission. She jokingly says that she'll have to make it through the mission intact, which concerns Bubble Man. Despite assuring him that she can handle it, Bubble Man isn't convinced given the uncertainty of what the anomaly is capable of and if the other pieces are inside other robots. He decides to postpone his meeting with Dr. Wily and come along on the journey to watch her back. Joke-Explainer accepts Bubble Man's help, welcoming him aboard as they set off to the anomaly's next location."
      },
      {
        "date": "October 29",
        "title": "Sea of Secrets - Episode 2",
        "content": "On their way to the underwater village, The Joke-Explainer™ 7000 contacts Dr. Andonuts to inform him of the incident with Imitation Krabs, noting that its data banks featured Haltmann Works Company branding. Dr. Andonuts calls in Plankton, another Haltmann Works employee, to explain himself. He confesses to building the Imitation Krabs to infiltrate the Underwater Village (which Mr. Krabs lived in) to steal the Krabby Patty secret formula, and is angered that Joke-Explainer and Bubble Man destroyed it. After Plankton is dismissed, Andonuts turns his attention to Bubble Man, questioning his intentions on joining Joke-Explainer on her mission due to Dr. Wily's conflicts with the Haltmann Works Company. Joke-Explainer backs Bubble Man up, trusting that he wants to protect her. Suddenly, the anomaly radar pings many times as the duo reaches the village. Joke-Explainer ends the call as the submersible goes into enemy territory."
      },
      {
        "content": "The two find the village being attacked by robots based on Crazy Frog, with insignia of The Voice on them. Bubble Man fends off the robots by trapping them in bubbles while Joke-Explainer leads nearby citizens to refuge. However, the robots are freed from their bubbles by other laser-wielding robots. Just as the duo are overwhelmed, they are saved by Undyne, who has fought off the Crazy Frog robots numerous times before. The legion of Crazy Frogs flee as Undyne comes down to greet Joke-Explainer and Bubble Man, but turns hostile assuming they were the enemy forces. The two explain that they want to help. Undyne decides to give them a chance, taking them to the Krusty Krab for a meal. There, Undyne recalls how the Crazy Frog robots always show up from the northwest, and only started appearing after Undyne had found someone who came from the same direction and took them in. Believing that this person may be a lead, Undyne takes Joke-Explainer and Bubble Man to this mystery person's house."
      },
      {
        "content": "The person in question was a Waddle Dee named Sailor Dee, a navigator on the battleship Halberd. Undyne convinces him to tell his story, and the trio learns from Sailor Dee that he was on the Halberd during its fight against The Voice. When the battleship was shot down and crashed into the water, most of the other crew members perished due to a lack of oxygen while the survivors had to form their own community. One week later, the Halberd's systems and robots went haywire and the world seemingly became \"corrupted\" alongside the arrival of a glitchy entity. Having escaped the Halberd while being dazed and confused, Sailor Dee was found by Undyne and eventually moved into the Underwater Village, though still traumatized about his experiences."
      },
      {
        "content": "The Joke-Explainer determines that the anomalous signals must've originated from the Halberd and asks him for the battleship's coordinates. He initially refuses to do so out of fear for their safety, but eventually yields after the Joke-Explainer states that the coordinates are valuable information others can use even if they fail. It is at this moment that an even larger swarm of Crazy Frog robots attack the Underwater Village once more, with the Joke-Explainer, Bubble Man and Undyne heading out to fight them. Joke-Explainer realizes that they came to retrieve the capture cartridge with the anomaly she and Bubble Man previously captured. She tries to apologize to Undyne for inadvertently bringing the robots to the village, but Undyne encourages Joke-Explainer to focus and come up with a plan."
      },
      {
        "content": "Joke-Explainer deduces that the Crazy Frog robots need to be brought together in one stop and taken out all at once, and comes up with the plan. Bubble Man holds the cartridge with the anomaly piece inside and lure all of the robots outside of the village, allowing Undyne to pierce them all with a hellzone grenade of spears. The robots are vaporized, leaving a mass of pixelated clumps remaining, which are safely contained in bubbles by Bubble Man, and brought together into one giant bubble to be absorbed into the second capture cartridge. Joke-Explainer and Bubble Man plan on going to the Halberd to find the anomaly once and for all, with Undyne joining the party as well. The trio head back to the sub to check in with Dr. Andonuts before heading for the final destination of their journey."
      },
      {
        "date": "November 5",
        "title": "[Trailer Theme - Iron Lung: The Movie]",
        "content": "Charlie has a dream where he tells the SiIvaGunner audience his life story, including how he first met and befriended the Numberphile. He is awoken from this dream by Krater, who receives information from Pink and Yellow that a boat is headed towards the island’s shore."
      },
      {
        "date": "November 6",
        "title": "Sea of Secrets - Episode 3",
        "content": "On their way to the Halberd, The Joke-Explainer once again contacts Andonuts and learns that the Crazy Frog robots were rogue Haltmann Works machines. Undyne becomes angry after learning Joke-Explainer and Andonuts work for the company due to the Voice and President Haltmann's actions, but Andonuts reassures her that the company is changing its ways and that they genuinely want to help her. After the Joke-Explainer and Bubble Man ask if they are safe from the anomaly's corruption, Andonuts reveals he traced the anomalous signals' origins to a data leak during the SiIva AI Incident. When the SiIva AI tried to transfer data shards to the central computer system, an anomalous entity was accidentally fragmented and spread into the Haltmann Works Company's Machine Network Database. Using this information, Andonuts determines that the anomaly can't corrupt J.E. and Bubble Man without forming an internal connection with them, meaning that they are safe but still need to be careful."
      },
      {
        "content": "Approaching their destination, Andonuts calls the trio again and strongly advises them to wait for backup. Before Andonuts can interrupt the call, Alphys hears him talking about Undyne and enters a conversation with her girlfriend. The couple's tender conversation is interrupted by the Halberd's Main Cannon #2 attacking their submarine. The heroes dodge the cannon's projectiles only for its claw to grab their submarine and attempt to crush them to death. The heroes are unable to escape the submarine thanks to an argument between Bubble Man and Undyne as their vehicle is slammed into the bottom of the Halberd."
      },
      {
        "content": "With the anomalous signal distorting the Game Boy Fright's radar, the trio explores the sunken battleship and eventually an elevator. The Joke-Explainer refuses to take the elevator, so the trio walks further down the hallway and reaches a computer terminal. After the Joke-Explainer turns on the computer, a ghost appears on the screen and begins chasing our protagonists. Undyne drags Bubble Man and The Joke-Explainer to the elevator they found earlier, with the latter complaining about how nobody listens to him. The Joke-Explainer attempts to move the elevator up, but the ghost catches up to them and our protagonists are sent crashing down to the Halberd's hangar."
      },
      {
        "content": "While exploring the area, our heroes come across various vessels including the Heavy Lobster, which activates and attacks Bubble Man. Heavy Lobster's claws end up piercing Bubble Man's torso before it throws him aside and begins chasing Undyne and the Joke-Explainer. Heavily damaged, Bubble Man begins bleeding out oil and laments about how useless he is and that he'd only get in the way of his allies. Despite this, he refuses to let his friends be killed by the Heavy Lobster, firing his leaking oil at the Heavy Lobster to exploit its weakness to paint. Before the robot can charge at our heroes again, it is dragged away and the protagonists try to find a way to reach the ghost. Freaked out by her experiences, the Joke-Explainer's thought process comes to a screeching halt before Undyne gets her out of her mental lockdown. Undyne encourages the Joke-Explainer to keep her head calm and that they're here to watch her back, also coming up with the idea to have her lift Bubble Man to the bridge of the Halberd."
      },
      {
        "content": "It is here they seemingly find Meta Knight, who is supposed to be in The Voice's Tower at this very moment. \"Meta Knight\" turns around only to reveal that it was the ghost the trio was chasing and begins attacking Undyne. The ghost manages to successfully slash the captain of the Royal Guard, but she manages to knock it back by slashing it several times with her spear. When the trio moves to capture the anomaly, the ghost enters its \"second phase\" and begins chasing them once more. As the trio reach a dead end at the Halberd's reactor, the Joke-Explainer quickly comes up with a plan to capture the anomaly. The ghost charges towards Undyne, but Bubble Man catches it off-guard by trapping it inside one of his bubbles and sends it crashing into the Halberd's reactor. With the ghost now knocked out, the Joke-Explainer moves in to capture it."
      },
      {
        "content": "Having finally defeated the source of the anomalous activity, the Joke-Explainer, Bubble and Undyne swim back to the Underwater Village. Impressed by Bubble Man's skills, Undyne offers Bubble Man the opportunity to become a member of the village's \"Royal Guard\". While he initially hesitates because he needed to bring Robo-Krabs' hard drive back to Dr. Wily, Bubble Man decides to quit working for his creator and accepts Undyne's offer. As she needs to bring the captured anomaly back to Dr. Andonuts, the Joke-Explainer says goodbye to her travel companions, though not before promising that someone will set up a communicator for Undyne and Alphys."
      },
      {
        "title": "[Missingno Fusion Collab]:",
        "content": "Andonuts begins the process of fusing MissingNo together, which involves forcing it to relive all of its memories and and results in an audiovisual readout of its life. After being fully reformed, MissingNo is initially disoriented, then experiences a state of distress before breaking out and going missing. (i can,t believe it’s missing... no...)"
      },
      {
        "content": "During the fusion process, footage of HCB.exe appears on one of the laboratory’s screens. HCB.exe experiences a major error, becoming unable to feel his mind and losing most of his face. The canonicity and wider implications of his appearance are unknown as of writing."
      },
      {
        "date": "November 9",
        "content": "Due to Haltmann Works Company being generally distressed, Stingy is given temporary channel control for two days."
      },
      {
        "title": "[Gensokyo, Past and Present ~ Flower Land - Touhou 9: Phantasmagoria of Flower View]:",
        "content": "The disguised HCB parties with a few Omegas, including Gegagedigedagedago and Omega Milkshake, and a Brainless, though has trouble staying in-sync with the others."
      },
      {
        "title": "[My New Friend (In-Game Version) - KinitoPET - Part 1]:",
        "content": "After the conclusion of the Omega party, HCB is confronted by the Omega Milkshake, who warns him that Ninja and the Walmart Yodelling Kid are trying to kill him and questions if he’s evil. HCB then gets the idea to give Omega Milkshake the picture of a cat stored on the Fisher-Price Hacker’s laptop and leaves to retrieve it."
      },
      {
        "title": "[Doomsday's Comin' - Duke Caribbean: Life's a Beach]:",
        "content": "The numberphile arrives on ei ei ei vacation island and kills Krater, which causes the surviving members of the Larva Yakuza and Charlie to flee in terror. The steak is halted in his tracks by the Kitty Inside Your Heart, who explains that he wants to kill Charlie and Numberphile for their murder of Tsunko and Pandaba."
      },
      {
        "content": "The tension between the trio is interrupted by HCB, who retrieves an image of a cat from the Fisher-Price Hacker’s laptop. Charlie uses the distraction caused by HCB.exe’s appearance to flee to Gegagedigedagedago’s sheriff office, while the numberphile destroys HCB’s Crazy Teleporter and forces him walk all the way back to the Mesa. Noticing that Charlie went missing, numberphile and Kitty briefly fight until the former also leaves, with the latter promising to hunt both of them down. At Gegagedigedagedago’s sheriff office, the Nugget learns that the Kitty is after Charlie from Omega Peanut, only to find the Steak inside one of his holding cells."
      },
      {
        "date": "November 10",
        "content": "Stingy accidentally swaps his Golden Channel Access Ticket with the Know-It-All Kid’s golden ticket at school. As a result, the channel is abruptly hijacked by Know-It-All Kid."
      },
      {
        "date": "November 11",
        "content": "Circunflexo announces on the Official SiIvaGunner Fanserver that CCC 12 will not be released during December 2025 or January 2026, citing the team’s overcommitment to releasing Sea of Secrets, Lethal Proceedings and CCC 12 in the same calendar year."
      },
      {
        "date": "November 12",
        "content": "The Joke-Explainer™ 7000 and Stingy regain control of the channel."
      },
      {
        "date": "November 13",
        "content": "Circunflexo reveals that CCC 12’s storyboarding is 90% complete."
      },
      {
        "title": "[My New Friend (In-Game Version) - KinitoPET - Part 2]:",
        "content": "HCB returns to Omega Milkshake in the Mesa and gives him an image of a cat. After befriending Omega Milkshake, he receives directions to reach Young Gegagedi’s space center and uses the 3d printer to create the Redirector. Only needing a place to extract energy for the device, HCB has the Star of Bethlehem (now an Omega) take him to the world’s strongest source of energy."
      },
      {
        "date": "November 24",
        "content": "[Freedom - Speak & Spell] is uploaded, containing a spoken Google Drive link that acts as the beginning of the GORK ARG."
      },
      {
        "date": "November 25",
        "content": "The GORK ARG is completed, and two rewards are given to the solvers in the form of Tsurupettan rips - the Alpha Mix is a mostly cut and dry YTP(MV) primarily based on the [adult swim] staple Bird Up!, but the endings of the Alpha and Live Mix contain elements of lore that effectively canonise the live-action universe."
      },
      {
        "title": "[Tsurupettan (Alpha Mix) - Umineko no Naku Koro ni]:",
        "content": "Leonard tells Franklin to air the Bird Up! special and uses another five-leaf clover to travel to an unknown universe to confront Gork."
      },
      {
        "title": "[Tsurupettan (Live Mix - Umineko no Naku Koro ni]:",
        "content": "The Bird Up! special airs and Dick Goofy is fired."
      },
      {
        "date": "November 29",
        "title": "[Alphys Lab (Unused) (Used) - Undertale]:",
        "content": "Ninja and the Yodelling Kid visit the Fisher-Price Hacker’s laptop through the Universe Connection Establisher 2.0 in search for tools in their fight against HCB. Here they obtain a red square used to defeat the Fisher-Price Hacker and unintentionally summon Mr. Game & Watch, who joins their party. Upon leaving the laptop, the trio notices the Universe Connection Establisher 2.0 being moved and the skies turning grey."
      },
      {
        "title": "[The Device - Fortnite Chapter 2]:",
        "content": "The Star of Bethlehem leads HCB to the Agency from Fortnite and the Zero Point. Using the Zero Point as the energy source for the Redirector, HCB moves the Universe Connection Establisher 2.0 to above the device as it fires a beam at it. This results in the Universe Connection Establisher 2.0 becoming the Channel Connection Establisher 2.0, which connects to the SiIvaGunner channel and allows HCB to begin his takeover."
      },
      {
        "date": "December 3",
        "title": "[Bliss - KinitoPET]:",
        "content": "After 2.5 days of hosting, HCB notices that reality is starting to break down and prepares to look for new universes to move his operation to. Before he can leave, he is confronted by Ninja, the Yodelling Kid and Mr. Game & Watch as a battle approaches. Nearly being subsumed by the red square, HCB uses Blazikenite to turn into a new form as the fight resumes. Despite his best efforts, HCB is distracted by Omega Milkshake and thrown into the Redirector’s beam. This results in HCB being sent back to the Fisher-Price Hacker’s laptop, alongside losing his items and connection with the SiIvaGunner channel."
      },
      {
        "content": "HCB's 'takeover' ends with only 22 rips to his name, something that SiIvaCord users disapprove of, given the grand scale of prior events like Sea of Secrets and the large amount of attention given by the SiIva team towards him throughout the year."
      },
      {
        "title": "[Terminal | SiIvaSwim]:",
        "content": "The Gork files are released publicly."
      },
      {
        "date": "December 7",
        "content": "Fan submissions to TimmyTurnersGrandDad formally close."
      },
      {
        "date": "December 15:",
        "title": "[The Plan - End of the Line]",
        "content": "Charlie explains his situation involving The Kitty Inside Your Heart and The numberphile to Gegagedigedagedago. In response, the Omega Nugget calls Boykisser and Pomni so that they can help him in his plan to prevent Charlie’s death by appealing to his enemies’ interests. Using one of Young Gegagedi’s “e” tiles, Boykisser travels to the Sanrio Universe with the goal of convincing Hello Kitty to come with him and talk down the Kitty Inside Your Heart. Meanwhile, Pomni is given the task to teach Charlie math and Gegagedigedagedago himself stays on guard for the Numberphile and Kitty Inside Your Heart."
      },
      {
        "title": "[UndefinedSprite_2.71828 (Unused) - Bad Tsunko no Doki Doki Omikuji]",
        "content": "Badtz-Maru finds one of the Numberphiles and opens a portal to the Coordinate Plane. After checking Numberphile’s computer and discovering a reminder to clear the Recycling Bin, Badtz-Maru opens and ends up falling into it."
      },
      {
        "title": "[Interior - Minecraft: Hello Kitty and Friends]",
        "content": "Boykisser arrives in the Sanrio Universe, manages to convince Hello Kitty to come with him to stop the Kitty Inside Your Heart and gives her one of his “e” tiles. Visiting Badtz-Maru’s house next, Boykisser learns from the former’s diary that he tried asking Kuromi for help in resurrecting Pandaba and Tsunko. Boykisser then visits Kuromi and learns from her that Pandaba and Tsunko may not be dead, but trapped in another dimension, due to the latter’s inability to channel their ghosts. Outside of Kuromi’s house, Boykisser discovers a message by the Kitty Inside Your Heart commanding him to leave, after which the Silly Cat opens a portal leading back to the Omega Universe."
      },
      {
        "title": "[Be Prepared (In-Game Version) - Enter the Matrix]",
        "content": "Badtz-Maru traverses the Numberphile’s Recycling Bin and learns from Omega Crab Lays that Pandaba and Tsunko’s spirits are inside the grid. After listening to the Numberphile’s musing about his former partnership with Charlie, The Steak, Badtz-Maru ends up discovering Tsunko’s spirit."
      },
      {
        "title": "[Equal Drill (In-Game Version) - Math Play]",
        "content": "Pomni tries teaching Charlie math, only to quit both due to the steak’s inability to solve basic problems and one of the cards becoming an Omega."
      },
      {
        "title": "[Purin - Friday Night Funkin’ Lullaby]",
        "content": "Badtz-Maru fights against Tsunko in a Friday Night Funkin’ rap battle to purify her and Pandababa’s spirits."
      },
      {
        "title": "[Victory! - Bad Tsunko no Doki Doki Omikuji]",
        "content": "Badtz-Maru manages to revive Pandaba and Tsunko through the use of Easter Spirit. Finding the Dangerous Teleporter previously used by HCB.exe, the trio and Krater leave the Recycling Bin and end up back inside the Coordinate Plane. The group encounters The numberphile, who opens an \"e\" portal to the Sanrio Universe, allowing Badtz-Maru, Tsunko and Pandaba to go back home, with Krater joining them."
      },
      {
        "title": "[∇ - e]",
        "content": "The long-teased showdown between the Kitty Inside Your Heart and The numberphile ensues. During the showdown, Numberphile summons several antagonists from previous storylines, such as Evil as Shit Brainless, CraftyCorn and the Egg Bandits, while the Kitty Inside Your Heart summons Green de la Bean and Kuromi angels. The fight reaches its climax with the Kitty transforming into his Alpha-Omega form and Numberphile summoning the Blue-Eyes White Dragon from Yu-Gi-Oh, with the two of them engaging in a beam struggle against each other. Pomni tells the onlooking Boykisser and Gegagedigedagedago that they need to flee to Super Mario World, while a desperate Charlie cracks open the Egg of All-Devouring Darkness. This results in the world being covered in darkness and turning it into omegarune."
      },
      {
        "title": "[Running Minigame - Charlie, the Steak]",
        "content": "Charlie chases after the Kitty Inside Your Heart in a Dark World before reuniting with Boykisser, Pomni and Gegagedigedagedago. Charlie's soul shines a light in the seemingly endless darkness and the four of them proceed towards the Kitty Inside Your Heart's location and take his swords for each other. During their journey, Gegagedigedagedago becomes inanimate and Pomni calls out Charlie for his seeming inability to accept the consequences of his actions. Boykisser then reminds her that Gegagedigedagedago wanted Charlie to survive as the trio proceeds onwards to their final showdown."
      },
      {
        "title": "[Bussin' Knife - Omegarune]",
        "content": "The trio arrives at the same Cuh room where Charlie first obtained the Egg of All-Devouring Darkness. The Kitty Inside Your Heart reveals to the trio that the Cuh who gave Charlie his egg told him the prophecy from \"The Dark Truth (PS4 Version) - Deltarune\", but that the steak didn't end up fending for himself. The Kitty Inside Your Heart draws his sword and the final showdown between the trio and him commends. Charlie tries to attack the Kitty with a mallet before the latter realizes that Boykisser and Pomni are mostly harmless, which leads to him swooning them so they'll get out of his way. Meanwhile, Numberphile comes across the inanimate Gegagedigedagedago and tries to leave the universe forever out of guilt."
      },
      {
        "content": "Before he can leave, Gegagedigedagedago gives the Numberphile a save point and transforms the latter into Omega Man. Back with Charlie, he is tortured by the Kitty Inside Your Heart as punishment for his actions. Just in the nick of time, the Numberphile saves Charlie and defeats the Kitty Inside Your Heart in a short battle. Hello Kitty then arrives to talk down the Kitty Inside Your Heart from continuing his revenge and reveals that Pandaba and Tsunko are back. The Kitty Inside Your Heart realizes that vengeance wasn't the answer and works together with the Numberphile and Charlie to close the Dark Foundation and restore the Omega Universe."
      },
      {
        "title": "[Title Theme & Ending - Charlie, the Steak]",
        "content": "Gegagedigedagedago becomes animate again to the joy of Boykisser and Pomni. The Kitty Inside Your Heart says goodbye to the residents of the Omega Universe and is invited to come to the Sanrio World more often by Hello Kitty. The numberphile meets with Charlie and apologizes for scaring him, with Charlie correctly solving a math equation. Hello Kitty walks up to the duo to reveal that Pandaba and Tsunko have been revived and that they shouldn't be afraid to face their problems and that happiness is a number on a chart. Boykisser, Pomni and Gegagedigedagedago watch Hello Kitty and the Kitty Inside Your Heart leave their universe as peace is finally restored to the Omega Universe."
      },
      {
        "date": "December 20:",
        "title": "[Season's Greetings!]",
        "content": "Robbie Rotten (pretending to be Santa Claus) hacks Dr. Andonuts’ broadcast and takes over the SiIvaGunner channel for the year’s Christmas event. Meanwhile, Joke-Explainer is kept occupied by Bobbie, Tobbie and Flobbie (disguised as Santa’s elves) asking her the jokes of an assortment of rips. He keeps his specific motivation for taking over the channel a secret."
      },
      {
        "date": "December 25:",
        "content": "Second Termination [FILE-19] is released onto the SiIvaGunner channel, providing much-theorised context regarding the 2019 SiIvaGunner Termination."
      },
      {
        "date": "December 29",
        "title": "[LOT Polish Airlines - A Date with Boykisser!]",
        "content": "Y/N and Boykisser meet up at the airport in preparation for their vacation to Poland. The two board the plane and spend the long flight watching A Minecraft Movie (which starts Omegas), with Boykisser revealing Steve lives in the mines near Super Mario World. Boykisser repeatedly presses the button to call the flight attendant and asks for salmon. Y/N and Boykisser share some Pocky before the plan lands hours later. Due to forgetting the plans he made for Kissmass, Boykisser gives Y/N the option to either [explore Poland] or [meet his family]."
      },
      {
        "title": "[Taking the Next Step - A Date with Boykisser!]",
        "content": "After a long day, Y/N and Boykisser call an Uber and return to their hotel room. Y/N asks if Boykisser wants to marry them and gives him a ring with salmon on it. Boykisser accepts and the two of them return to Boykisser’s home through his shortcut so he can eat the salmon gifted to him. Y/N asks Boykisser if they couldn’t just use the shortcut from the start instead of taking the plane, but Boykisser revealed he forgot about it."
      },
      {
        "date": "December 30",
        "content": "MissingNo. [FILE-23] - Haltmann's Archives is uploaded to the SiIvaGunner channel to give extra content to the Sea of Secrets event. According to ackrostation, this FILE was meant to release far sooner, though was delayed due to burnout after Sea of Secrets."
      },
      {
        "date": "December 31",
        "content": "TimmyTurnersGrandDad officially goes on indefinite hiatus."
      },
      {
        "title": "[Santa's Surprising Sign-off!]",
        "content": "Robbie Rotten reveals himself as the 'Santa' behind the Christmas 2025 event (although the community knew almost immediately because of his voice and the mere mention of the other three doppelgänger Robbies as his elves). He also reveals that the event was an attempt to contact Wood Man, and in a last-gasp attempt uses the Wood Finder 4000 (which was rebuilt after being destroyed by Stingy during the beginning of Season Mine) to try and find him, connecting to the bridge used by the solvers of the Susie ARG."
      },
      {
        "title": "[Opening Scene - Waluigi’s Tacostand - Nintendo Switch 2 Edition] (December 25, 2016) (Concurrent with Sea of Secrets)",
        "content": "Due to nobody buying his tacos and the Voice raising the gas prices, Waluigi's taco stand truck is put out of business. Meanwhile, Wario gets bored of lying in the streets and decides to beat up Waluigi for wasting his money on SiIvaGunner pachinko machines. Back at Waluigi's apartment, Mr. Rent offers him a brand new job at the WEEGEE towers so he can pay his rent. Upon arriving at the hotel, Waluigi meets up with Wario, who had encountered Mr. Rent on his way to beat up Waluigi and was also offered a job at the WEEGEE towers."
      },
      {
        "content": "WEEGEE then appears to greet his new employees and promises to pay them a lot of money for the job. To introduce the ins and outs of their work, WEEGEE has Bobbie, Tobbie and Flobbie Rotten show them the ropes. The trio introduces Wario and Waluigi to the motto of the WEEGEE towers, \"you will die\", and reveal they just need to do what their boss instructs them to do. After getting into their uniforms, Wario and Waluigi receive their first guest in the form of Play-yan. When Play-yan tries to order spaghetti, Waluigi tells him they need to order a room before Wario suddenly kills them. Being unable to remember Play-yan due to them being a figment, Wario and Waluigi quickly move onto their next guest, Goku. Goku orders a room at the hotel, leaving Waluigi confused on why he isn't fighting against the Voice before getting him one."
      },
      {
        "content": "With Goku leaving through the wrong door, Wario and Waluigi are then approached by Gaijin Goomba, Pac-Man and Woodsans. Woodsans requests a room for them to enjoy as platonic friends and Pac-Man tries ordering a meatball, a room and a bagel. Gaijin Goomba explains that Pac-Man hasn't been the same since he smoked Christmas Spirit and Waluigi decides to just give them room keys so they'll leave. WEEGEE once again appears before his hotel slaves, ordering Waluigi to take the throuple's bags to their room and Wario to make the DINNER. Waluigi tries taking the elevator, only for WEEGEE to force Waluigi to take the stairs as he appears inside the elevator Waluigi wanted to take. Meanwhile, Wario is taught how to make DINNER and munf munf by King Harkinian and finds himself in love with the king. Back with Waluigi at the staircase, WEEGEE appears in front of him and tells him he will die."
      },
      {
        "content": "An exploding Pokéball is thrown at WEEGEE as Professor E. Gadd appears at the scene. Having arrived to contain an anomaly as per the Haltmann Works Company's new directive, E. Gadd tells Waluigi to run as he begins fighting against WEEGEE. This battle ends with E. Gadd capturing WEEGEE with the Poltergust, with E. Gadd planning on informing Dr. Andonuts about his newly-captured specimen. In the hotel's lobby, Wario and Waluigi learn about WEEGEE being captured and decide to become the new owners of the hotel, seeing an opportunity to get rich. Unfortunately for the dastardly duo, the WEEGEE towers disappear as a result of WEEGEE's capture, leaving both of them without a job once more. Some time later, Robbie Rotten contacts Bobbie, Tobbie and Flobbie and requests their assistance in his latest scheme (being the events of Season’s Greetings)."
      },
      {
        "title": "[ROTTEN]",
        "content": "Robbie Rotten’s signal reaches Wood Man inside the Void while he’s having a guilt-induced nightmare. This leads to the SiIva AI’s core in Wood Man’s nightmare morphing into the shadowy form of Robbie Rotten, with Wood Man and the shadowy Robbie facing off against each other in a Friday Night Funkin’ rap battle. During this rap battle, the location changes from the nuclear wastelands of Doomfes to the Summerfes beach and Westernfes desert before returning to a post-AI death version of the Doomfes wasteland."
      },
      {
        "content": "Near the end of the rap battle, Robbie? directly calls out Wood Man for him abandoning everyone in the CCC, even morphing into the SiIva A.I. when calling Wood Man a “savior with nothing left to save”. Wood Man wakes up from his nightmare, remaining as depressed as since we last saw him."
      }
    ]
  }
]